{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### <b>Ханойские башни</b>\n",
    "Головоломка <<Ханойские башни>> состоит из трёх стержней, пронумеруем их слева направо: 1, 2 и 3. Также в головоломке используется стопка дисков с отверстием посередине. Радиус дисков уменьшается снизу вверх. Изначально диски расположены на левом стержне (стержень 1), самый большой диск находится внизу. Диски в игре перемещаются по одному со стержня на стержень. Диск можно надеть на стержень, только если он пустой или верхний диск на нём большего размера, чем перемещаемый. Цель головоломки — перенести все диски со стержня 1 на стержень 3.\n",
    "\n",
    "Требуется найти последовательность ходов, которая решает головоломку <<Ханойские башни>>.\n",
    "\n",
    "<b>Формат ввода</b><br>\n",
    "В первой строке задано одно число 𝑛 (3≤𝑛≤10) — количество дисков на первой башне.\n",
    "\n",
    "<b>Формат вывода</b><br>\n",
    "В первой строке выведите количество операций 𝑘.\n",
    "В следующих 𝑘 строках выведите по два числа в каждой 𝑥_𝑖, 𝑦_𝑖 (1≤ 𝑥_𝑖,𝑦_𝑖≤3) — переместить верхний диск со стержня \n",
    "𝑥_𝑖 на стержень 𝑦_𝑖."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open('input.txt','r') as f:\n",
    "    n = int(f.readlines()[0])\n",
    "\n",
    "opers = []\n",
    "\n",
    "def HanoiTowers(n,frm,to,opers):\n",
    "    if n == 1:\n",
    "        opers.append((frm,to))\n",
    "        return opers\n",
    "    unused = 6 - frm - to\n",
    "    HanoiTowers(n-1,frm,unused,opers)\n",
    "    opers.append((frm,to))\n",
    "    HanoiTowers(n-1,unused,to,opers)\n",
    "    return opers\n",
    "    \n",
    "\n",
    "r = HanoiTowers(n,1,3,opers)\n",
    "print(len(r))\n",
    "for e in r:\n",
    "    print(f\"{e[0]} {e[1]}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### <b>Ханойские башни 2</b>\n",
    "Головоломка <<Ханойские башни>> состоит из трёх стержней, пронумеруем их слева направо: 1, 2 и 3. Также в головоломке используется стопка дисков с отверстием посередине. Радиус дисков уменьшается снизу вверх. Изначально диски расположены на левом стержне (стержень 1), самый большой диск находится внизу. Диски в игре перемещаются по одному со стержня на стержень. Диск можно надеть на стержень, только если он пустой или верхний диск на нём большего размера, чем перемещаемый. Цель головоломки — перенести все диски со стержня 1 на стержень 3.\n",
    "\n",
    "Немного изменим правила. Теперь головоломка состоит из четырех стержней, а цель головоломки — перенести все диски со стержня 1 на стержень 4. Найдите минимальное количество ходов, за которое можно решить головоломку.\n",
    "\n",
    "<b>Формат ввода</b><br>\n",
    "В первой строке задано одно число \n",
    "𝑛 (3≤𝑛≤10) — количество дисков на первой башне.\n",
    "\n",
    "<b>Формат вывода</b><br>\n",
    "В единственной строке выведите ответ на задачу."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# ЗАДАЧА НЕ РЕШЕНА, ТЕСТЫ С ОШИБКОЙ.\n",
    "# Верное решение изложено в статье https://dl.acm.org/doi/pdf/10.1145/126459.126460\n",
    "# Существует решение, которое проходит тесты, но оно не является корректным - неверный ответ для 15 колец."
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
