{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### <b>Наибольший общий делитель</b>\n",
    "\n",
    "Для двух чисел 𝑎 и 𝑏 найдите их наибольший общий делитель.\n",
    "\n",
    "<b>Формат ввода</b>\n",
    "\n",
    "Целые числа 𝑎 и 𝑏 (разделённые пробелом).\n",
    "\n",
    "<b>Ограничения:</b> \n",
    "\n",
    "1≤𝑎,𝑏≤2⋅10^9\n",
    "\n",
    "<b>Формат вывода</b>\n",
    "\n",
    "Наибольший общий делитель чисел 𝑎 и 𝑏."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def inp_list(line,fname='input.txt'):\n",
    "    with open(fname,'r') as f:\n",
    "        l = f.readlines()[line].split(' ')\n",
    "        for i in range(len(l)):\n",
    "            l[i] = int(l[i])\n",
    "    return l\n",
    "\n",
    "\n",
    "def GCD(a,b):\n",
    "    while a>0 and b>0:\n",
    "        if a>=b:\n",
    "            a = a % b\n",
    "        else:\n",
    "            b = b % a\n",
    "    return max(a,b)\n",
    "\n",
    "\n",
    "a,b = inp_list(0)\n",
    "\n",
    "print(GCD(a,b))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### <b>Наименьшее общее кратное</b>\n",
    "\n",
    "Для двух чисел 𝑎 и 𝑏 найдите их наименьшее общее кратное.\n",
    "\n",
    "<b>Формат ввода</b>\n",
    "\n",
    "Целые числа 𝑎 и 𝑏 (разделённые пробелом).\n",
    "\n",
    "<b>Ограничения: </b>\n",
    "\n",
    "1≤𝑎,𝑏≤2⋅10^9\n",
    "\n",
    "<b>Формат вывода</b>\n",
    "\n",
    "Наименьшее общее кратное чисел 𝑎 и 𝑏."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def inp_list(line,fname='input.txt'):\n",
    "    with open(fname,'r') as f:\n",
    "        l = f.readlines()[line].split(' ')\n",
    "        for i in range(len(l)):\n",
    "            l[i] = int(l[i])\n",
    "    return l\n",
    "\n",
    "def GDC(a,b):\n",
    "    while a>0 and b>0:\n",
    "        if a>=b:\n",
    "            a = a % b\n",
    "        else:\n",
    "            b = b % a\n",
    "    return max(a,b)\n",
    "\n",
    "def LCM(a,b):\n",
    "    return a*b//GDC(a,b)\n",
    "\n",
    "a,b = inp_list(0)\n",
    "print(int(LCM(a,b)))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### <b>Наибольшее число шагов алгоритма Евклида</b>\n",
    "\n",
    "Алгоритм Евклида можно записать в рекурсивной форме:\n",
    "\n",
    "GCD(a, b):\n",
    "    if a = 0 or b = 0:\n",
    "        return max(a,b)\n",
    "    return GCD(b,a mod b)\n",
    "\n",
    "Вызов функции GCD(5,0) не порождает дополнительных рекурсивных вызовов. А вызов GCD(5,2) - порождает вызовы GCD(2,1) и GCD(1,0).\n",
    "\n",
    "Количество шагов алгоритма Евклида будет равняться количеству вызовов функции GCD для заданных значений 𝑎 и 𝑏.\n",
    "\n",
    "Дано число 𝑛, найдите значения 𝑎 и 𝑏 (0≤𝑎,𝑏≤𝑛), для которых количество вызовов функции GCD будет наибольшим.\n",
    "\n",
    "<b>Формат ввода</b>\n",
    "\n",
    "Целое число 𝑛.\n",
    "\n",
    "<b>Ограничения:</b> \n",
    "\n",
    "1≤𝑛≤10^9\n",
    "\n",
    "<b>Формат вывода</b>\n",
    "\n",
    "Значения 𝑎 и 𝑏 (разделённые пробелом).\n",
    "\n",
    "Если существует несколько пар значений 𝑎 и 𝑏, для которых количество вызовов функции GCD наибольшее, то выведите любую из таких пар."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Наибольшее число шагов алгоритма Евклида\n",
    "def inp_str(line,fname='input.txt'):\n",
    "    with open(fname,'r') as f:\n",
    "        l = f.readlines()[line]\n",
    "    return l\n",
    "\n",
    "def print_list(l):\n",
    "    for e in l:\n",
    "        print(e,end=' ')\n",
    "\n",
    "def GDCr(a,b,i):\n",
    "    i+=1\n",
    "    if a == 0 or b == 0:\n",
    "        return max(a,b),i\n",
    "    return GDCr(b,a%b,i)\n",
    "\n",
    "# слишком медленный для теста 3\n",
    "def n_Euclid_slow(n):\n",
    "    res = []\n",
    "    for i in range(n+1):\n",
    "        for j in range(i,n+1):\n",
    "            res.append((i,j,GDCr(i,j,0)[1]))\n",
    "    res.sort(key=lambda x: x[2])\n",
    "    return ' '.join(str(x) for x in res[-1][:2])+f\" n_steps={res[-1][2]}\"\n",
    "\n",
    "# все еще медленный\n",
    "def n_Euclid_slow2(n):\n",
    "    n_steps = 0\n",
    "    pair = (1,n)\n",
    "    for i in range(n+1):\n",
    "        for j in range(n,i,-1):\n",
    "            gdc_res = GDCr(i,j,0)\n",
    "            if n_steps < gdc_res[1]:\n",
    "                n_steps = gdc_res[1]\n",
    "                pair = (i,j) \n",
    "    return pair, n_steps\n",
    "\n",
    "# максимум вызовов достигается для двх чисел Фибоначчи\n",
    "def n_Euclid_fib(n):\n",
    "    fib_1 = fib2(0)\n",
    "    fib_2 = fib2(1)\n",
    "    i = 2\n",
    "    while fib_2 <= n:\n",
    "        fib_new = fib2(i)\n",
    "        if fib_new > n:\n",
    "            return fib_1,fib_2\n",
    "        fib_1 = fib_2\n",
    "        fib_2 = fib_new\n",
    "        i+=1\n",
    "    return fib_1,fib_2\n",
    "\n",
    "\n",
    "def fib2(n):\n",
    "    if n == 0:\n",
    "        return 0\n",
    "    elif n == 1:\n",
    "        return 1\n",
    "    else:\n",
    "        fib_n2 = 0\n",
    "        fib_n1 = 1\n",
    "        fib_res = 1\n",
    "        for _ in range(2,n):\n",
    "            fib_n2 = fib_n1\n",
    "            fib_n1 = fib_res\n",
    "            fib_res = fib_n1+fib_n2        \n",
    "    return fib_res\n",
    "\n",
    "\n",
    "n=int(inp_str(0))\n",
    "print_list(n_Euclid_fib(n))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
