{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### <b>Количество призов</b>\n",
    "\n",
    "Вы занимаетесь организацией соревнований для детей, и у вас есть 𝑛 n конфет, которые вы раздадите в качестве призов. Вы хотите отдать эти конфеты тем, кто займет первые 𝑘 k мест в соревнованиях, и распределить конфеты так, чтобы за более высокое место всегда выходило больше конфет.\n",
    "\n",
    "Чтобы порадовать как можно больше детей, вам понадобится найти самое большое значение 𝑘 k, при котором это возможно.\n",
    "\n",
    "<b>Формат ввода</b>\n",
    "\n",
    "Целое число 𝑛.\n",
    "\n",
    "<b>Ограничения: </b>\n",
    "\n",
    "1≤𝑛≤10^9\n",
    "\n",
    "<b>Формат вывода</b>\n",
    "\n",
    "Единственная строка: максимальное число 𝑘, при котором 𝑛 можно представить как сумму 𝑘 различных положительных целых чисел."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "vscode": {
     "languageId": "plaintext"
    }
   },
   "outputs": [],
   "source": [
    "def inp_str(line,fname='input.txt'):\n",
    "    with open(fname,'r') as f:\n",
    "        l = f.readlines()[line]\n",
    "    return l\n",
    "\n",
    "n = int(inp_str(0))\n",
    "\n",
    "k=0\n",
    "while n >= k*(k+1)/2:\n",
    "    k+=1\n",
    "print(k-1)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
