{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### <b>Расстановка королей на шахматной доске</b>\n",
    "\n",
    "Шахматы — очень интересная древнейшая настольная игра для двух игроков. Для решения этой задаче необязательно знать шахматные правила, но это может быть полезно.\n",
    "\n",
    "В шахматах король — самая важная фигура. Король может сделать ход на любую из 8 соседних клеток шахматной доски. Соседними считаются клетки слева, справа, сверху, снизу и 4 по диагонали от рассматриваемой. В шахматной партии на игровом поле ровно один король каждого цвета.\n",
    "\n",
    "Рассмотри задачу-головоломку о нескольких шахматных королях на доске произвольного размера.\n",
    "\n",
    "Рассмотрим шахматную доску с 𝑟 строками и 𝑐 столбцами. Найдите наибольшее количество королей, которых можно разместить на доске 𝑟×𝑐, с выполнение следующих условий:\n",
    "\n",
    "В любой клетке на доске может находиться не более одного короля.\n",
    "У любого короля есть по крайней мере один возможный ход на свободную клетку на доске.\n",
    "\n",
    "<b>Формат ввода</b>\n",
    "\n",
    "Единственная строка содержит два целых числа 𝑟 и 𝑐.\n",
    "\n",
    "<b>Ограничения: </b>\n",
    "\n",
    "1≤𝑟,𝑐100.\n",
    "\n",
    "<b>Формат вывода</b>\n",
    "\n",
    "Наибольшее количество королей."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "vscode": {
     "languageId": "plaintext"
    }
   },
   "outputs": [],
   "source": [
    "def inp_list(line,fname='input.txt'):\n",
    "    with open(fname,'r') as f:\n",
    "        l = f.readlines()[line].split(' ')\n",
    "        for i in range(len(l)):\n",
    "            l[i] = int(l[i])\n",
    "    return l\n",
    "\n",
    "\n",
    "r,c = inp_list(0)\n",
    "\n",
    "\n",
    "def kings(r,c):\n",
    "\n",
    "    k = c*r\n",
    "    minus_r = r//3\n",
    "    minus_c = c//3\n",
    "\n",
    "    if r%3!=0:\n",
    "        minus_r +=1\n",
    "    if c%3!=0:\n",
    "        minus_c +=1\n",
    "\n",
    "    k = k - minus_r*minus_c \n",
    "    return k\n",
    "\n",
    "print(kings(r,c))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
